k6/results/kafka/run-01/02-collaboration-latency.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6/02-collaboration-latency.js
        output: json (k6/results/kafka/02-collaboration-latency.json)

     scenarios: (100.00%) 1 scenario, 30 max VUs, 4m30s max duration (incl. graceful stop):
              * collab_latency: Up to 30 looping VUs for 4m0s over 5 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/30 VUs, 0 complete and 0 interrupted iterations
collab_latency   [   0% ] 01/30 VUs  0m00.8s/4m00.0s

running (0m02.0s), 01/30 VUs, 0 complete and 0 interrupted iterations
collab_latency   [   1% ] 01/30 VUs  0m01.8s/4m00.0s

running (0m03.0s), 01/30 VUs, 0 complete and 0 interrupted iterations
collab_latency   [   1% ] 01/30 VUs  0m02.8s/4m00.0s

running (0m04.0s), 02/30 VUs, 0 complete and 0 interrupted iterations
collab_latency   [   2% ] 02/30 VUs  0m03.8s/4m00.0s

running (0m05.0s), 02/30 VUs, 0 complete and 0 interrupted iterations
collab_latency   [   2% ] 02/30 VUs  0m04.8s/4m00.0s

running (0m06.0s), 02/30 VUs, 1 complete and 0 interrupted iterations
collab_latency   [   2% ] 02/30 VUs  0m05.8s/4m00.0s

running (0m07.0s), 03/30 VUs, 1 complete and 0 interrupted iterations
collab_latency   [   3% ] 03/30 VUs  0m06.8s/4m00.0s

running (0m08.0s), 03/30 VUs, 1 complete and 0 interrupted iterations
collab_latency   [   3% ] 03/30 VUs  0m07.8s/4m00.0s

running (0m09.0s), 03/30 VUs, 1 complete and 0 interrupted iterations
collab_latency   [   4% ] 03/30 VUs  0m08.8s/4m00.0s

running (0m10.0s), 03/30 VUs, 1 complete and 0 interrupted iterations
collab_latency   [   4% ] 03/30 VUs  0m09.8s/4m00.0s

running (0m11.0s), 04/30 VUs, 1 complete and 0 interrupted iterations
collab_latency   [   4% ] 04/30 VUs  0m10.8s/4m00.0s

running (0m12.0s), 04/30 VUs, 2 complete and 0 interrupted iterations
collab_latency   [   5% ] 04/30 VUs  0m11.8s/4m00.0s

running (0m13.0s), 04/30 VUs, 2 complete and 0 interrupted iterations
collab_latency   [   5% ] 04/30 VUs  0m12.8s/4m00.0s

running (0m14.0s), 05/30 VUs, 4 complete and 0 interrupted iterations
collab_latency   [   6% ] 05/30 VUs  0m13.8s/4m00.0s

running (0m15.0s), 05/30 VUs, 4 complete and 0 interrupted iterations
collab_latency   [   6% ] 05/30 VUs  0m14.8s/4m00.0s

running (0m16.0s), 05/30 VUs, 5 complete and 0 interrupted iterations
collab_latency   [   7% ] 05/30 VUs  0m15.8s/4m00.0s

running (0m17.0s), 06/30 VUs, 6 complete and 0 interrupted iterations
collab_latency   [   7% ] 06/30 VUs  0m16.8s/4m00.0s

running (0m18.0s), 06/30 VUs, 6 complete and 0 interrupted iterations
collab_latency   [   7% ] 06/30 VUs  0m17.8s/4m00.0s

running (0m19.0s), 06/30 VUs, 8 complete and 0 interrupted iterations
collab_latency   [   8% ] 06/30 VUs  0m18.8s/4m00.0s

running (0m20.0s), 06/30 VUs, 9 complete and 0 interrupted iterations
collab_latency   [   8% ] 06/30 VUs  0m19.8s/4m00.0s

running (0m21.0s), 07/30 VUs, 10 complete and 0 interrupted iterations
collab_latency   [   9% ] 07/30 VUs  0m20.8s/4m00.0s

running (0m22.0s), 07/30 VUs, 12 complete and 0 interrupted iterations
collab_latency   [   9% ] 07/30 VUs  0m21.8s/4m00.0s

running (0m23.0s), 07/30 VUs, 12 complete and 0 interrupted iterations
collab_latency   [   9% ] 07/30 VUs  0m22.8s/4m00.0s

running (0m24.0s), 08/30 VUs, 12 complete and 0 interrupted iterations
collab_latency   [  10% ] 08/30 VUs  0m23.8s/4m00.0s

running (0m25.0s), 08/30 VUs, 12 complete and 0 interrupted iterations
collab_latency   [  10% ] 08/30 VUs  0m24.8s/4m00.0s

running (0m26.0s), 08/30 VUs, 13 complete and 0 interrupted iterations
collab_latency   [  11% ] 08/30 VUs  0m25.8s/4m00.0s

running (0m27.0s), 09/30 VUs, 16 complete and 0 interrupted iterations
collab_latency   [  11% ] 09/30 VUs  0m26.8s/4m00.0s

running (0m28.0s), 09/30 VUs, 17 complete and 0 interrupted iterations
collab_latency   [  12% ] 09/30 VUs  0m27.8s/4m00.0s

running (0m29.0s), 09/30 VUs, 18 complete and 0 interrupted iterations
collab_latency   [  12% ] 09/30 VUs  0m28.8s/4m00.0s

running (0m30.0s), 09/30 VUs, 19 complete and 0 interrupted iterations
collab_latency   [  12% ] 09/30 VUs  0m29.8s/4m00.0s

running (0m31.0s), 10/30 VUs, 21 complete and 0 interrupted iterations
collab_latency   [  13% ] 10/30 VUs  0m30.8s/4m00.0s

running (0m32.0s), 10/30 VUs, 22 complete and 0 interrupted iterations
collab_latency   [  13% ] 10/30 VUs  0m31.8s/4m00.0s

running (0m33.0s), 10/30 VUs, 23 complete and 0 interrupted iterations
collab_latency   [  14% ] 10/30 VUs  0m32.8s/4m00.0s

running (0m34.0s), 10/30 VUs, 23 complete and 0 interrupted iterations
collab_latency   [  14% ] 10/30 VUs  0m33.8s/4m00.0s

running (0m35.0s), 10/30 VUs, 25 complete and 0 interrupted iterations
collab_latency   [  14% ] 10/30 VUs  0m34.8s/4m00.0s

running (0m36.0s), 10/30 VUs, 25 complete and 0 interrupted iterations
collab_latency   [  15% ] 10/30 VUs  0m35.8s/4m00.0s

running (0m37.0s), 11/30 VUs, 26 complete and 0 interrupted iterations
collab_latency   [  15% ] 11/30 VUs  0m36.8s/4m00.0s

running (0m38.0s), 11/30 VUs, 28 complete and 0 interrupted iterations
collab_latency   [  16% ] 11/30 VUs  0m37.8s/4m00.0s

running (0m39.0s), 11/30 VUs, 28 complete and 0 interrupted iterations
collab_latency   [  16% ] 11/30 VUs  0m38.8s/4m00.0s

running (0m40.0s), 11/30 VUs, 29 complete and 0 interrupted iterations
collab_latency   [  17% ] 11/30 VUs  0m39.8s/4m00.0s

running (0m41.0s), 11/30 VUs, 31 complete and 0 interrupted iterations
collab_latency   [  17% ] 11/30 VUs  0m40.8s/4m00.0s

running (0m42.0s), 11/30 VUs, 32 complete and 0 interrupted iterations
collab_latency   [  17% ] 11/30 VUs  0m41.8s/4m00.0s

running (0m43.0s), 12/30 VUs, 32 complete and 0 interrupted iterations
collab_latency   [  18% ] 12/30 VUs  0m42.8s/4m00.0s

running (0m44.0s), 12/30 VUs, 35 complete and 0 interrupted iterations
collab_latency   [  18% ] 12/30 VUs  0m43.8s/4m00.0s

running (0m45.0s), 12/30 VUs, 37 complete and 0 interrupted iterations
collab_latency   [  19% ] 12/30 VUs  0m44.8s/4m00.0s

running (0m46.0s), 12/30 VUs, 40 complete and 0 interrupted iterations
collab_latency   [  19% ] 12/30 VUs  0m45.8s/4m00.0s

running (0m47.0s), 12/30 VUs, 40 complete and 0 interrupted iterations
collab_latency   [  19% ] 12/30 VUs  0m46.8s/4m00.0s

running (0m48.0s), 12/30 VUs, 42 complete and 0 interrupted iterations
collab_latency   [  20% ] 12/30 VUs  0m47.8s/4m00.0s

running (0m49.0s), 13/30 VUs, 42 complete and 0 interrupted iterations
collab_latency   [  20% ] 13/30 VUs  0m48.8s/4m00.0s

running (0m50.0s), 13/30 VUs, 43 complete and 0 interrupted iterations
collab_latency   [  21% ] 13/30 VUs  0m49.8s/4m00.0s

running (0m51.0s), 13/30 VUs, 43 complete and 0 interrupted iterations
collab_latency   [  21% ] 13/30 VUs  0m50.8s/4m00.0s

running (0m52.0s), 13/30 VUs, 45 complete and 0 interrupted iterations
collab_latency   [  22% ] 13/30 VUs  0m51.8s/4m00.0s

running (0m53.0s), 13/30 VUs, 47 complete and 0 interrupted iterations
collab_latency   [  22% ] 13/30 VUs  0m52.8s/4m00.0s

running (0m54.0s), 13/30 VUs, 49 complete and 0 interrupted iterations
collab_latency   [  22% ] 13/30 VUs  0m53.8s/4m00.0s

running (0m55.0s), 14/30 VUs, 51 complete and 0 interrupted iterations
collab_latency   [  23% ] 14/30 VUs  0m54.8s/4m00.0s

running (0m56.0s), 14/30 VUs, 53 complete and 0 interrupted iterations
collab_latency   [  23% ] 14/30 VUs  0m55.8s/4m00.0s

running (0m57.0s), 14/30 VUs, 54 complete and 0 interrupted iterations
collab_latency   [  24% ] 14/30 VUs  0m56.8s/4m00.0s

running (0m58.0s), 14/30 VUs, 55 complete and 0 interrupted iterations
collab_latency   [  24% ] 14/30 VUs  0m57.8s/4m00.0s

running (0m59.0s), 14/30 VUs, 58 complete and 0 interrupted iterations
collab_latency   [  24% ] 14/30 VUs  0m58.8s/4m00.0s

running (1m00.0s), 14/30 VUs, 59 complete and 0 interrupted iterations
collab_latency   [  25% ] 14/30 VUs  0m59.8s/4m00.0s

running (1m01.0s), 15/30 VUs, 61 complete and 0 interrupted iterations
collab_latency   [  25% ] 15/30 VUs  1m00.8s/4m00.0s

running (1m02.0s), 15/30 VUs, 63 complete and 0 interrupted iterations
collab_latency   [  26% ] 15/30 VUs  1m01.8s/4m00.0s

running (1m03.0s), 15/30 VUs, 66 complete and 0 interrupted iterations
collab_latency   [  26% ] 15/30 VUs  1m02.8s/4m00.0s

running (1m04.0s), 15/30 VUs, 66 complete and 0 interrupted iterations
collab_latency   [  27% ] 15/30 VUs  1m03.8s/4m00.0s

running (1m05.0s), 15/30 VUs, 68 complete and 0 interrupted iterations
collab_latency   [  27% ] 15/30 VUs  1m04.8s/4m00.0s

running (1m06.0s), 15/30 VUs, 70 complete and 0 interrupted iterations
collab_latency   [  27% ] 15/30 VUs  1m05.8s/4m00.0s

running (1m07.0s), 16/30 VUs, 71 complete and 0 interrupted iterations
collab_latency   [  28% ] 16/30 VUs  1m06.8s/4m00.0s

running (1m08.0s), 16/30 VUs, 73 complete and 0 interrupted iterations
collab_latency   [  28% ] 16/30 VUs  1m07.8s/4m00.0s

running (1m09.0s), 16/30 VUs, 74 complete and 0 interrupted iterations
collab_latency   [  29% ] 16/30 VUs  1m08.8s/4m00.0s

running (1m10.0s), 16/30 VUs, 78 complete and 0 interrupted iterations
collab_latency   [  29% ] 16/30 VUs  1m09.8s/4m00.0s

running (1m11.0s), 16/30 VUs, 79 complete and 0 interrupted iterations
collab_latency   [  29% ] 16/30 VUs  1m10.8s/4m00.0s

running (1m12.0s), 16/30 VUs, 82 complete and 0 interrupted iterations
collab_latency   [  30% ] 16/30 VUs  1m11.8s/4m00.0s

running (1m13.0s), 17/30 VUs, 86 complete and 0 interrupted iterations
collab_latency   [  30% ] 17/30 VUs  1m12.8s/4m00.0s

running (1m14.0s), 17/30 VUs, 86 complete and 0 interrupted iterations
collab_latency   [  31% ] 17/30 VUs  1m13.8s/4m00.0s

running (1m15.0s), 17/30 VUs, 89 complete and 0 interrupted iterations
collab_latency   [  31% ] 17/30 VUs  1m14.8s/4m00.0s

running (1m16.0s), 17/30 VUs, 93 complete and 0 interrupted iterations
collab_latency   [  32% ] 17/30 VUs  1m15.8s/4m00.0s

running (1m17.0s), 17/30 VUs, 94 complete and 0 interrupted iterations
collab_latency   [  32% ] 17/30 VUs  1m16.8s/4m00.0s

running (1m18.0s), 17/30 VUs, 96 complete and 0 interrupted iterations
collab_latency   [  32% ] 17/30 VUs  1m17.8s/4m00.0s

running (1m19.0s), 18/30 VUs, 98 complete and 0 interrupted iterations
collab_latency   [  33% ] 18/30 VUs  1m18.8s/4m00.0s

running (1m20.0s), 18/30 VUs, 100 complete and 0 interrupted iterations
collab_latency   [  33% ] 18/30 VUs  1m19.8s/4m00.0s

running (1m21.0s), 18/30 VUs, 103 complete and 0 interrupted iterations
collab_latency   [  34% ] 18/30 VUs  1m20.8s/4m00.0s

running (1m22.0s), 18/30 VUs, 104 complete and 0 interrupted iterations
collab_latency   [  34% ] 18/30 VUs  1m21.8s/4m00.0s

running (1m23.0s), 18/30 VUs, 106 complete and 0 interrupted iterations
collab_latency   [  34% ] 18/30 VUs  1m22.8s/4m00.0s

running (1m24.0s), 18/30 VUs, 110 complete and 0 interrupted iterations
collab_latency   [  35% ] 18/30 VUs  1m23.8s/4m00.0s

running (1m25.0s), 19/30 VUs, 111 complete and 0 interrupted iterations
collab_latency   [  35% ] 19/30 VUs  1m24.8s/4m00.0s

running (1m26.0s), 19/30 VUs, 112 complete and 0 interrupted iterations
collab_latency   [  36% ] 19/30 VUs  1m25.8s/4m00.0s

running (1m27.0s), 19/30 VUs, 114 complete and 0 interrupted iterations
collab_latency   [  36% ] 19/30 VUs  1m26.8s/4m00.0s

running (1m28.0s), 19/30 VUs, 117 complete and 0 interrupted iterations
collab_latency   [  37% ] 19/30 VUs  1m27.8s/4m00.0s

running (1m29.0s), 19/30 VUs, 119 complete and 0 interrupted iterations
collab_latency   [  37% ] 19/30 VUs  1m28.8s/4m00.0s

running (1m30.0s), 19/30 VUs, 119 complete and 0 interrupted iterations
collab_latency   [  37% ] 19/30 VUs  1m29.8s/4m00.0s

running (1m31.0s), 20/30 VUs, 123 complete and 0 interrupted iterations
collab_latency   [  38% ] 20/30 VUs  1m30.8s/4m00.0s

running (1m32.0s), 20/30 VUs, 124 complete and 0 interrupted iterations
collab_latency   [  38% ] 20/30 VUs  1m31.8s/4m00.0s

running (1m33.0s), 20/30 VUs, 127 complete and 0 interrupted iterations
collab_latency   [  39% ] 20/30 VUs  1m32.8s/4m00.0s

running (1m34.0s), 20/30 VUs, 131 complete and 0 interrupted iterations
collab_latency   [  39% ] 20/30 VUs  1m33.8s/4m00.0s

running (1m35.0s), 20/30 VUs, 134 complete and 0 interrupted iterations
collab_latency   [  39% ] 20/30 VUs  1m34.8s/4m00.0s

running (1m36.0s), 20/30 VUs, 136 complete and 0 interrupted iterations
collab_latency   [  40% ] 20/30 VUs  1m35.8s/4m00.0s

running (1m37.0s), 21/30 VUs, 141 complete and 0 interrupted iterations
collab_latency   [  40% ] 21/30 VUs  1m36.8s/4m00.0s

running (1m38.0s), 21/30 VUs, 143 complete and 0 interrupted iterations
collab_latency   [  41% ] 21/30 VUs  1m37.8s/4m00.0s

running (1m39.0s), 21/30 VUs, 143 complete and 0 interrupted iterations
collab_latency   [  41% ] 21/30 VUs  1m38.8s/4m00.0s

running (1m40.0s), 21/30 VUs, 146 complete and 0 interrupted iterations
collab_latency   [  42% ] 21/30 VUs  1m39.8s/4m00.0s

running (1m41.0s), 21/30 VUs, 147 complete and 0 interrupted iterations
collab_latency   [  42% ] 21/30 VUs  1m40.8s/4m00.0s

running (1m42.0s), 21/30 VUs, 148 complete and 0 interrupted iterations
collab_latency   [  42% ] 21/30 VUs  1m41.8s/4m00.0s

running (1m43.0s), 22/30 VUs, 151 complete and 0 interrupted iterations
collab_latency   [  43% ] 22/30 VUs  1m42.8s/4m00.0s

running (1m44.0s), 22/30 VUs, 154 complete and 0 interrupted iterations
collab_latency   [  43% ] 22/30 VUs  1m43.8s/4m00.0s

running (1m45.0s), 22/30 VUs, 155 complete and 0 interrupted iterations
collab_latency   [  44% ] 22/30 VUs  1m44.8s/4m00.0s

running (1m46.0s), 22/30 VUs, 156 complete and 0 interrupted iterations
collab_latency   [  44% ] 22/30 VUs  1m45.8s/4m00.0s

running (1m47.0s), 22/30 VUs, 158 complete and 0 interrupted iterations
collab_latency   [  44% ] 22/30 VUs  1m46.8s/4m00.0s

running (1m48.0s), 22/30 VUs, 158 complete and 0 interrupted iterations
collab_latency   [  45% ] 22/30 VUs  1m47.8s/4m00.0s

running (1m49.0s), 23/30 VUs, 159 complete and 0 interrupted iterations
collab_latency   [  45% ] 23/30 VUs  1m48.8s/4m00.0s

running (1m50.0s), 23/30 VUs, 161 complete and 0 interrupted iterations
collab_latency   [  46% ] 23/30 VUs  1m49.8s/4m00.0s

running (1m51.0s), 23/30 VUs, 164 complete and 0 interrupted iterations
collab_latency   [  46% ] 23/30 VUs  1m50.8s/4m00.0s

running (1m52.0s), 23/30 VUs, 167 complete and 0 interrupted iterations
collab_latency   [  47% ] 23/30 VUs  1m51.8s/4m00.0s

running (1m53.0s), 23/30 VUs, 171 complete and 0 interrupted iterations
collab_latency   [  47% ] 23/30 VUs  1m52.8s/4m00.0s

running (1m54.0s), 23/30 VUs, 176 complete and 0 interrupted iterations
collab_latency   [  47% ] 23/30 VUs  1m53.8s/4m00.0s

running (1m55.0s), 24/30 VUs, 177 complete and 0 interrupted iterations
collab_latency   [  48% ] 24/30 VUs  1m54.8s/4m00.0s

running (1m56.0s), 24/30 VUs, 180 complete and 0 interrupted iterations
collab_latency   [  48% ] 24/30 VUs  1m55.8s/4m00.0s

running (1m57.0s), 24/30 VUs, 181 complete and 0 interrupted iterations
collab_latency   [  49% ] 24/30 VUs  1m56.8s/4m00.0s

running (1m58.0s), 24/30 VUs, 181 complete and 0 interrupted iterations
collab_latency   [  49% ] 24/30 VUs  1m57.8s/4m00.0s

running (1m59.0s), 24/30 VUs, 187 complete and 0 interrupted iterations
collab_latency   [  49% ] 24/30 VUs  1m58.8s/4m00.0s

running (2m00.0s), 24/30 VUs, 191 complete and 0 interrupted iterations
collab_latency   [  50% ] 24/30 VUs  1m59.8s/4m00.0s

running (2m01.0s), 25/30 VUs, 193 complete and 0 interrupted iterations
collab_latency   [  50% ] 25/30 VUs  2m00.8s/4m00.0s

running (2m02.0s), 25/30 VUs, 194 complete and 0 interrupted iterations
collab_latency   [  51% ] 25/30 VUs  2m01.8s/4m00.0s

running (2m03.0s), 25/30 VUs, 194 complete and 0 interrupted iterations
collab_latency   [  51% ] 25/30 VUs  2m02.8s/4m00.0s

running (2m04.0s), 25/30 VUs, 194 complete and 0 interrupted iterations
collab_latency   [  52% ] 25/30 VUs  2m03.8s/4m00.0s

running (2m05.0s), 25/30 VUs, 196 complete and 0 interrupted iterations
collab_latency   [  52% ] 25/30 VUs  2m04.8s/4m00.0s

running (2m06.0s), 25/30 VUs, 200 complete and 0 interrupted iterations
collab_latency   [  52% ] 25/30 VUs  2m05.8s/4m00.0s

running (2m07.0s), 26/30 VUs, 202 complete and 0 interrupted iterations
collab_latency   [  53% ] 26/30 VUs  2m06.8s/4m00.0s

running (2m08.0s), 26/30 VUs, 204 complete and 0 interrupted iterations
collab_latency   [  53% ] 26/30 VUs  2m07.8s/4m00.0s

running (2m09.0s), 26/30 VUs, 205 complete and 0 interrupted iterations
collab_latency   [  54% ] 26/30 VUs  2m08.8s/4m00.0s

running (2m10.0s), 26/30 VUs, 208 complete and 0 interrupted iterations
collab_latency   [  54% ] 26/30 VUs  2m09.8s/4m00.0s

running (2m11.0s), 26/30 VUs, 209 complete and 0 interrupted iterations
collab_latency   [  54% ] 26/30 VUs  2m10.8s/4m00.0s

running (2m12.0s), 26/30 VUs, 211 complete and 0 interrupted iterations
collab_latency   [  55% ] 26/30 VUs  2m11.8s/4m00.0s

running (2m13.0s), 27/30 VUs, 213 complete and 0 interrupted iterations
collab_latency   [  55% ] 27/30 VUs  2m12.8s/4m00.0s

running (2m14.0s), 27/30 VUs, 217 complete and 0 interrupted iterations
collab_latency   [  56% ] 27/30 VUs  2m13.8s/4m00.0s

running (2m15.0s), 27/30 VUs, 218 complete and 0 interrupted iterations
collab_latency   [  56% ] 27/30 VUs  2m14.8s/4m00.0s

running (2m16.0s), 27/30 VUs, 223 complete and 0 interrupted iterations
collab_latency   [  57% ] 27/30 VUs  2m15.8s/4m00.0s

running (2m17.0s), 27/30 VUs, 228 complete and 0 interrupted iterations
collab_latency   [  57% ] 27/30 VUs  2m16.8s/4m00.0s

running (2m18.0s), 27/30 VUs, 229 complete and 0 interrupted iterations
collab_latency   [  57% ] 27/30 VUs  2m17.8s/4m00.0s

running (2m19.0s), 28/30 VUs, 233 complete and 0 interrupted iterations
collab_latency   [  58% ] 28/30 VUs  2m18.8s/4m00.0s

running (2m20.0s), 28/30 VUs, 234 complete and 0 interrupted iterations
collab_latency   [  58% ] 28/30 VUs  2m19.8s/4m00.0s

running (2m21.0s), 28/30 VUs, 235 complete and 0 interrupted iterations
collab_latency   [  59% ] 28/30 VUs  2m20.8s/4m00.0s

running (2m22.0s), 28/30 VUs, 238 complete and 0 interrupted iterations
collab_latency   [  59% ] 28/30 VUs  2m21.8s/4m00.0s

running (2m23.0s), 28/30 VUs, 240 complete and 0 interrupted iterations
collab_latency   [  59% ] 28/30 VUs  2m22.8s/4m00.0s

running (2m24.0s), 28/30 VUs, 246 complete and 0 interrupted iterations
collab_latency   [  60% ] 28/30 VUs  2m23.8s/4m00.0s

running (2m25.0s), 29/30 VUs, 248 complete and 0 interrupted iterations
collab_latency   [  60% ] 29/30 VUs  2m24.8s/4m00.0s

running (2m26.0s), 29/30 VUs, 249 complete and 0 interrupted iterations
collab_latency   [  61% ] 29/30 VUs  2m25.8s/4m00.0s

running (2m27.0s), 29/30 VUs, 250 complete and 0 interrupted iterations
collab_latency   [  61% ] 29/30 VUs  2m26.8s/4m00.0s

running (2m28.0s), 29/30 VUs, 251 complete and 0 interrupted iterations
collab_latency   [  62% ] 29/30 VUs  2m27.8s/4m00.0s

running (2m29.0s), 29/30 VUs, 253 complete and 0 interrupted iterations
collab_latency   [  62% ] 29/30 VUs  2m28.8s/4m00.0s

running (2m30.0s), 29/30 VUs, 256 complete and 0 interrupted iterations
collab_latency   [  62% ] 29/30 VUs  2m29.8s/4m00.0s

running (2m31.0s), 30/30 VUs, 257 complete and 0 interrupted iterations
collab_latency   [  63% ] 30/30 VUs  2m30.8s/4m00.0s

running (2m32.0s), 30/30 VUs, 259 complete and 0 interrupted iterations
collab_latency   [  63% ] 30/30 VUs  2m31.8s/4m00.0s

running (2m33.0s), 30/30 VUs, 261 complete and 0 interrupted iterations
collab_latency   [  64% ] 30/30 VUs  2m32.8s/4m00.0s

running (2m34.0s), 30/30 VUs, 262 complete and 0 interrupted iterations
collab_latency   [  64% ] 30/30 VUs  2m33.8s/4m00.0s

running (2m35.0s), 29/30 VUs, 266 complete and 0 interrupted iterations
collab_latency   [  64% ] 29/30 VUs  2m34.8s/4m00.0s

running (2m36.0s), 29/30 VUs, 266 complete and 0 interrupted iterations
collab_latency   [  65% ] 29/30 VUs  2m35.8s/4m00.0s

running (2m37.0s), 29/30 VUs, 269 complete and 0 interrupted iterations
collab_latency   [  65% ] 29/30 VUs  2m36.8s/4m00.0s

running (2m38.0s), 29/30 VUs, 272 complete and 0 interrupted iterations
collab_latency   [  66% ] 29/30 VUs  2m37.8s/4m00.0s

running (2m39.0s), 29/30 VUs, 272 complete and 0 interrupted iterations
collab_latency   [  66% ] 29/30 VUs  2m38.8s/4m00.0s

running (2m40.0s), 29/30 VUs, 275 complete and 0 interrupted iterations
collab_latency   [  67% ] 29/30 VUs  2m39.8s/4m00.0s

running (2m41.0s), 29/30 VUs, 277 complete and 0 interrupted iterations
collab_latency   [  67% ] 29/30 VUs  2m40.8s/4m00.0s

running (2m42.0s), 29/30 VUs, 278 complete and 0 interrupted iterations
collab_latency   [  67% ] 29/30 VUs  2m41.8s/4m00.0s

running (2m43.0s), 29/30 VUs, 283 complete and 0 interrupted iterations
collab_latency   [  68% ] 29/30 VUs  2m42.8s/4m00.0s

running (2m44.0s), 29/30 VUs, 288 complete and 0 interrupted iterations
collab_latency   [  68% ] 29/30 VUs  2m43.8s/4m00.0s

running (2m45.0s), 28/30 VUs, 291 complete and 0 interrupted iterations
collab_latency   [  69% ] 28/30 VUs  2m44.8s/4m00.0s

running (2m46.0s), 28/30 VUs, 292 complete and 0 interrupted iterations
collab_latency   [  69% ] 28/30 VUs  2m45.8s/4m00.0s

running (2m47.0s), 27/30 VUs, 297 complete and 0 interrupted iterations
collab_latency   [  69% ] 27/30 VUs  2m46.8s/4m00.0s

running (2m48.0s), 27/30 VUs, 300 complete and 0 interrupted iterations
collab_latency   [  70% ] 27/30 VUs  2m47.8s/4m00.0s

running (2m49.0s), 27/30 VUs, 302 complete and 0 interrupted iterations
collab_latency   [  70% ] 27/30 VUs  2m48.8s/4m00.0s

running (2m50.0s), 27/30 VUs, 305 complete and 0 interrupted iterations
collab_latency   [  71% ] 27/30 VUs  2m49.8s/4m00.0s

running (2m51.0s), 27/30 VUs, 307 complete and 0 interrupted iterations
collab_latency   [  71% ] 27/30 VUs  2m50.8s/4m00.0s

running (2m52.0s), 27/30 VUs, 307 complete and 0 interrupted iterations
collab_latency   [  72% ] 27/30 VUs  2m51.8s/4m00.0s

running (2m53.0s), 26/30 VUs, 313 complete and 0 interrupted iterations
collab_latency   [  72% ] 26/30 VUs  2m52.8s/4m00.0s

running (2m54.0s), 26/30 VUs, 316 complete and 0 interrupted iterations
collab_latency   [  72% ] 26/30 VUs  2m53.8s/4m00.0s

running (2m55.0s), 26/30 VUs, 319 complete and 0 interrupted iterations
collab_latency   [  73% ] 26/30 VUs  2m54.8s/4m00.0s

running (2m56.0s), 25/30 VUs, 322 complete and 0 interrupted iterations
collab_latency   [  73% ] 25/30 VUs  2m55.8s/4m00.0s

running (2m57.0s), 25/30 VUs, 324 complete and 0 interrupted iterations
collab_latency   [  74% ] 25/30 VUs  2m56.8s/4m00.0s

running (2m58.0s), 25/30 VUs, 326 complete and 0 interrupted iterations
collab_latency   [  74% ] 25/30 VUs  2m57.8s/4m00.0s

running (2m59.0s), 25/30 VUs, 326 complete and 0 interrupted iterations
collab_latency   [  74% ] 25/30 VUs  2m58.8s/4m00.0s

running (3m00.0s), 25/30 VUs, 331 complete and 0 interrupted iterations
collab_latency   [  75% ] 25/30 VUs  2m59.8s/4m00.0s

running (3m01.0s), 25/30 VUs, 332 complete and 0 interrupted iterations
collab_latency   [  75% ] 25/30 VUs  3m00.8s/4m00.0s

running (3m02.0s), 25/30 VUs, 336 complete and 0 interrupted iterations
collab_latency   [  76% ] 25/30 VUs  3m01.8s/4m00.0s

running (3m03.0s), 24/30 VUs, 339 complete and 0 interrupted iterations
collab_latency   [  76% ] 24/30 VUs  3m02.8s/4m00.0s

running (3m04.0s), 24/30 VUs, 340 complete and 0 interrupted iterations
collab_latency   [  77% ] 24/30 VUs  3m03.8s/4m00.0s

running (3m05.0s), 24/30 VUs, 343 complete and 0 interrupted iterations
collab_latency   [  77% ] 24/30 VUs  3m04.8s/4m00.0s

running (3m06.0s), 24/30 VUs, 345 complete and 0 interrupted iterations
collab_latency   [  77% ] 24/30 VUs  3m05.8s/4m00.0s

running (3m07.0s), 24/30 VUs, 347 complete and 0 interrupted iterations
collab_latency   [  78% ] 24/30 VUs  3m06.8s/4m00.0s

running (3m08.0s), 23/30 VUs, 349 complete and 0 interrupted iterations
collab_latency   [  78% ] 23/30 VUs  3m07.8s/4m00.0s

running (3m09.0s), 22/30 VUs, 353 complete and 0 interrupted iterations
collab_latency   [  79% ] 22/30 VUs  3m08.8s/4m00.0s

running (3m10.0s), 21/30 VUs, 357 complete and 0 interrupted iterations
collab_latency   [  79% ] 21/30 VUs  3m09.8s/4m00.0s

running (3m11.0s), 21/30 VUs, 360 complete and 0 interrupted iterations
collab_latency   [  79% ] 21/30 VUs  3m10.8s/4m00.0s

running (3m12.0s), 21/30 VUs, 361 complete and 0 interrupted iterations
collab_latency   [  80% ] 21/30 VUs  3m11.8s/4m00.0s

running (3m13.0s), 21/30 VUs, 364 complete and 0 interrupted iterations
collab_latency   [  80% ] 21/30 VUs  3m12.8s/4m00.0s

running (3m14.0s), 21/30 VUs, 365 complete and 0 interrupted iterations
collab_latency   [  81% ] 21/30 VUs  3m13.8s/4m00.0s

running (3m15.0s), 20/30 VUs, 369 complete and 0 interrupted iterations
collab_latency   [  81% ] 20/30 VUs  3m14.8s/4m00.0s

running (3m16.0s), 20/30 VUs, 370 complete and 0 interrupted iterations
collab_latency   [  82% ] 20/30 VUs  3m15.8s/4m00.0s

running (3m17.0s), 20/30 VUs, 372 complete and 0 interrupted iterations
collab_latency   [  82% ] 20/30 VUs  3m16.8s/4m00.0s

running (3m18.0s), 20/30 VUs, 375 complete and 0 interrupted iterations
collab_latency   [  82% ] 20/30 VUs  3m17.8s/4m00.0s

running (3m19.0s), 20/30 VUs, 376 complete and 0 interrupted iterations
collab_latency   [  83% ] 20/30 VUs  3m18.8s/4m00.0s

running (3m20.0s), 19/30 VUs, 380 complete and 0 interrupted iterations
collab_latency   [  83% ] 19/30 VUs  3m19.8s/4m00.0s

running (3m21.0s), 19/30 VUs, 382 complete and 0 interrupted iterations
collab_latency   [  84% ] 19/30 VUs  3m20.8s/4m00.0s

running (3m22.0s), 19/30 VUs, 385 complete and 0 interrupted iterations
collab_latency   [  84% ] 19/30 VUs  3m21.8s/4m00.0s

running (3m23.0s), 18/30 VUs, 387 complete and 0 interrupted iterations
collab_latency   [  84% ] 18/30 VUs  3m22.8s/4m00.0s

running (3m24.0s), 18/30 VUs, 389 complete and 0 interrupted iterations
collab_latency   [  85% ] 18/30 VUs  3m23.8s/4m00.0s

running (3m25.0s), 18/30 VUs, 392 complete and 0 interrupted iterations
collab_latency   [  85% ] 18/30 VUs  3m24.8s/4m00.0s

running (3m26.0s), 18/30 VUs, 395 complete and 0 interrupted iterations
collab_latency   [  86% ] 18/30 VUs  3m25.8s/4m00.0s

running (3m27.0s), 18/30 VUs, 396 complete and 0 interrupted iterations
collab_latency   [  86% ] 18/30 VUs  3m26.8s/4m00.0s

running (3m28.0s), 18/30 VUs, 397 complete and 0 interrupted iterations
collab_latency   [  87% ] 18/30 VUs  3m27.8s/4m00.0s

running (3m29.0s), 18/30 VUs, 400 complete and 0 interrupted iterations
collab_latency   [  87% ] 18/30 VUs  3m28.8s/4m00.0s

running (3m30.0s), 18/30 VUs, 401 complete and 0 interrupted iterations
collab_latency   [  87% ] 18/30 VUs  3m29.8s/4m00.0s

running (3m31.0s), 18/30 VUs, 402 complete and 0 interrupted iterations
collab_latency   [  88% ] 18/30 VUs  3m30.8s/4m00.0s

running (3m32.0s), 18/30 VUs, 404 complete and 0 interrupted iterations
collab_latency   [  88% ] 18/30 VUs  3m31.8s/4m00.0s

running (3m33.0s), 16/30 VUs, 407 complete and 0 interrupted iterations
collab_latency   [  89% ] 16/30 VUs  3m32.8s/4m00.0s

running (3m34.0s), 15/30 VUs, 409 complete and 0 interrupted iterations
collab_latency   [  89% ] 15/30 VUs  3m33.8s/4m00.0s

running (3m35.0s), 15/30 VUs, 411 complete and 0 interrupted iterations
collab_latency   [  89% ] 15/30 VUs  3m34.8s/4m00.0s

running (3m36.0s), 15/30 VUs, 413 complete and 0 interrupted iterations
collab_latency   [  90% ] 15/30 VUs  3m35.8s/4m00.0s

running (3m37.0s), 15/30 VUs, 414 complete and 0 interrupted iterations
collab_latency   [  90% ] 15/30 VUs  3m36.8s/4m00.0s

running (3m38.0s), 15/30 VUs, 415 complete and 0 interrupted iterations
collab_latency   [  91% ] 15/30 VUs  3m37.8s/4m00.0s

running (3m39.0s), 14/30 VUs, 419 complete and 0 interrupted iterations
collab_latency   [  91% ] 14/30 VUs  3m38.8s/4m00.0s

running (3m40.0s), 14/30 VUs, 420 complete and 0 interrupted iterations
collab_latency   [  92% ] 14/30 VUs  3m39.8s/4m00.0s

running (3m41.0s), 13/30 VUs, 422 complete and 0 interrupted iterations
collab_latency   [  92% ] 13/30 VUs  3m40.8s/4m00.0s

running (3m42.0s), 13/30 VUs, 426 complete and 0 interrupted iterations
collab_latency   [  92% ] 13/30 VUs  3m41.8s/4m00.0s

running (3m43.0s), 12/30 VUs, 427 complete and 0 interrupted iterations
collab_latency   [  93% ] 12/30 VUs  3m42.8s/4m00.0s

running (3m44.0s), 12/30 VUs, 430 complete and 0 interrupted iterations
collab_latency   [  93% ] 12/30 VUs  3m43.8s/4m00.0s

running (3m45.0s), 12/30 VUs, 431 complete and 0 interrupted iterations
collab_latency   [  94% ] 12/30 VUs  3m44.8s/4m00.0s

running (3m46.0s), 12/30 VUs, 434 complete and 0 interrupted iterations
collab_latency   [  94% ] 12/30 VUs  3m45.8s/4m00.0s

running (3m47.0s), 11/30 VUs, 435 complete and 0 interrupted iterations
collab_latency   [  94% ] 11/30 VUs  3m46.8s/4m00.0s

running (3m48.0s), 11/30 VUs, 437 complete and 0 interrupted iterations
collab_latency   [  95% ] 11/30 VUs  3m47.8s/4m00.0s

running (3m49.0s), 10/30 VUs, 438 complete and 0 interrupted iterations
collab_latency   [  95% ] 10/30 VUs  3m48.8s/4m00.0s

running (3m50.0s), 09/30 VUs, 440 complete and 0 interrupted iterations
collab_latency   [  96% ] 09/30 VUs  3m49.8s/4m00.0s

running (3m51.0s), 09/30 VUs, 440 complete and 0 interrupted iterations
collab_latency   [  96% ] 09/30 VUs  3m50.8s/4m00.0s

running (3m52.0s), 09/30 VUs, 440 complete and 0 interrupted iterations
collab_latency   [  97% ] 09/30 VUs  3m51.8s/4m00.0s

running (3m53.0s), 08/30 VUs, 442 complete and 0 interrupted iterations
collab_latency   [  97% ] 08/30 VUs  3m52.8s/4m00.0s

running (3m54.0s), 08/30 VUs, 442 complete and 0 interrupted iterations
collab_latency   [  97% ] 08/30 VUs  3m53.8s/4m00.0s

running (3m55.0s), 08/30 VUs, 443 complete and 0 interrupted iterations
collab_latency   [  98% ] 08/30 VUs  3m54.8s/4m00.0s

running (3m56.0s), 07/30 VUs, 445 complete and 0 interrupted iterations
collab_latency   [  98% ] 07/30 VUs  3m55.8s/4m00.0s

running (3m57.0s), 07/30 VUs, 445 complete and 0 interrupted iterations
collab_latency   [  99% ] 07/30 VUs  3m56.8s/4m00.0s

running (3m58.0s), 07/30 VUs, 446 complete and 0 interrupted iterations
collab_latency   [  99% ] 07/30 VUs  3m57.8s/4m00.0s

running (3m59.0s), 05/30 VUs, 448 complete and 0 interrupted iterations
collab_latency   [  99% ] 05/30 VUs  3m58.8s/4m00.0s

running (4m00.0s), 04/30 VUs, 449 complete and 0 interrupted iterations
collab_latency   [ 100% ] 04/30 VUs  3m59.8s/4m00.0s

running (4m01.0s), 03/30 VUs, 450 complete and 0 interrupted iterations
collab_latency ↓ [ 100% ] 04/30 VUs  4m0s

running (4m02.0s), 03/30 VUs, 450 complete and 0 interrupted iterations
collab_latency ↓ [ 100% ] 04/30 VUs  4m0s

running (4m03.0s), 02/30 VUs, 451 complete and 0 interrupted iterations
collab_latency ↓ [ 100% ] 04/30 VUs  4m0s

running (4m04.0s), 02/30 VUs, 451 complete and 0 interrupted iterations
collab_latency ↓ [ 100% ] 04/30 VUs  4m0s

running (4m05.0s), 02/30 VUs, 451 complete and 0 interrupted iterations
collab_latency ↓ [ 100% ] 04/30 VUs  4m0s

running (4m06.0s), 02/30 VUs, 451 complete and 0 interrupted iterations
collab_latency ↓ [ 100% ] 04/30 VUs  4m0s

running (4m07.0s), 02/30 VUs, 451 complete and 0 interrupted iterations
collab_latency ↓ [ 100% ] 04/30 VUs  4m0s

running (4m08.0s), 01/30 VUs, 452 complete and 0 interrupted iterations
collab_latency ↓ [ 100% ] 04/30 VUs  4m0s

running (4m09.0s), 01/30 VUs, 452 complete and 0 interrupted iterations
collab_latency ↓ [ 100% ] 04/30 VUs  4m0s

running (4m10.0s), 01/30 VUs, 452 complete and 0 interrupted iterations
collab_latency ↓ [ 100% ] 04/30 VUs  4m0s


  █ THRESHOLDS 

    collab_propagation_ms
    ✗ 'p(95)<10000' p(95)=15.04s

    http_req_failed
    ✓ 'rate<0.2' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 453    1.809256/s
    checks_succeeded...: 48.34% 219 out of 453
    checks_failed......: 51.65% 234 out of 453

    ✓ DataExchange guest sees host state
    ✓ Advanced guest sees host state
    ✗ Analytics guest sees host state
      ↳  0% — ✓ 0 / ✗ 53
    ✗ MonteCarlo guest sees host state
      ↳  0% — ✓ 0 / ✗ 60
    ✓ Geospatial guest sees host state
    ✓ Calculator guest sees host state
    ✗ ClimateAnomaly guest sees host state
      ↳  0% — ✓ 0 / ✗ 62
    ✗ MLTrainer guest sees host state
      ↳  0% — ✓ 0 / ✗ 59

    CUSTOM
    collab_host_post_ms............: avg=110.68ms min=36ms    med=88ms    max=1.22s  p(90)=200ms    p(95)=295ms   
    collab_propagation_ms..........: avg=6.73s    min=34ms    med=11.62s  max=20.95s p(90)=13.97s   p(95)=15.04s  
    collab_success.................: 219    0.874673/s
    collab_timeout.................: 234    0.934582/s

    HTTP
    http_req_duration..............: avg=126.95ms min=30.58ms med=49.71ms max=3.42s  p(90)=217.04ms p(95)=496.02ms
      { expected_response:true }...: avg=126.95ms min=30.58ms med=49.71ms max=3.42s  p(90)=217.04ms p(95)=496.02ms
    http_req_failed................: 0.00%  0 out of 11856
    http_reqs......................: 11856  47.352173/s

    EXECUTION
    iteration_duration.............: avg=9.51s    min=1.38s   med=13.04s  max=23.65s p(90)=17.67s   p(95)=19.19s  
    iterations.....................: 453    1.809256/s
    vus............................: 1      min=1          max=30
    vus_max........................: 30     min=30         max=30

    NETWORK
    data_received..................: 6.3 MB 25 kB/s
    data_sent......................: 3.7 MB 15 kB/s



running (4m10.4s), 00/30 VUs, 453 complete and 0 interrupted iterations
collab_latency ✓ [ 100% ] 00/30 VUs  4m0s
time="2026-06-10T21:58:05+02:00" level=error msg="thresholds on metrics 'collab_propagation_ms' have been crossed"